Revit 2027 API
CylindricalSurface.Axis Property
 Axis of the cylinder. This is the Z axis of the local coordinate system associated with this cylinder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Axis { get; }
Public ReadOnly Property Axis As XYZ
	Get
public:
property XYZ^ Axis {
	XYZ^ get ();
}
member Axis : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalSurface Class
Autodesk.Revit.DB Namespace